---
type: RoofType
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# RoofType

`Autodesk.Revit.DB.RoofType` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Parameter | — | `` |
| Property | ThermalProperties | 2013 | `public ThermalProperties ThermalProperties { get ; }` |